Revit 2027 API
BuiltInFailures.EditingFailures.RPCTurnOffInRealisticWarn Property
 None of the placed RPC elements are visible when the visual style is set to Realistic. To see the elements, change VisualStyle of the current view, or change RPC visibility in Graphic Display Options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RPCTurnOffInRealisticWarn { get; }
Public Shared ReadOnly Property RPCTurnOffInRealisticWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RPCTurnOffInRealisticWarn {
	FailureDefinitionId^ get ();
}
static member RPCTurnOffInRealisticWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace